Project/Toir/src/DataProcessors/торо_ПодборОбъектовРемонтныхРабот/торо_ПодборОбъектовРемонтныхРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>торо_ПодборОбъектовРемонтныхРабот</name>
</mdclass:DataProcessor>

Project/Toir/src/InformationRegisters/торо_МаршрутыРегламентныхМероприятий/торо_МаршрутыРегламентныхМероприятий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_МаршрутыРегламентныхМероприятий</name>
  <resources>
    <name>НомерПоПорядку</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>СписокОбъектов</name>
    <type>
      <types>CatalogRef.торо_СписокОбъектовРегламентногоМероприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_РегламентныеМероприятияИСпискиОбъектов/торо_РегламентныеМероприятияИСпискиОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_РегламентныеМероприятияИСпискиОбъектов</name>
  <resources>
    <name>НормативныйРемонт</name>
    <type>
      <types>CatalogRef.торо_ИдентификаторыТехКарт</types>
    </type>
  </resources>
  <resources>
    <name>СпособПланирования</name>
    <type>
      <types>CatalogRef.торо_СпособыПланированияРемонтныхРабот</types>
    </type>
  </resources>
  <resources>
    <name>ГрафикРемонтныхРабот</name>
    <type>
      <types>CatalogRef.Календари</types>
    </type>
  </resources>
  <resources>
    <name>СпособВыполнения</name>
    <type>
      <types>EnumRef.СпособыСтроительства</types>
    </type>
  </resources>
  <resources>
    <name>СпособУчетаДатыОтсчета</name>
    <type>
      <types>EnumRef.торо_СпособыУчетаДатыОтсчетаПриПланированииРемонтныхРабот</types>
    </type>
  </resources>
  <resources>
    <name>НеУчаствуетВПланировании</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РазрешитьСокращатьМежремонтныйПериодПриПланировании</name>
    <comment>Разрешить сокращать период между ремонтами в случае, если начало ремонта приходится на выходной день</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НеУчитыватьПриПланированииГрафикРаботыОборудования</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НеУчитыватьПриПланированииГрафикРемонтныхРабот</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НеУчитыватьПродолжительность</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Продолжительность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьКоэффициентыРемонтныхОсобенностей</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СпособРасчетаПродолжительности</name>
    <type>
      <types>EnumRef.торо_СпособыРасчетаПродолжительности</types>
    </type>
  </resources>
  <dimensions>
    <name>СписокОбъектов</name>
    <type>
      <types>CatalogRef.торо_СписокОбъектовРегламентногоМероприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидМероприятия</name>
    <type>
      <types>CatalogRef.торо_ВидыРемонтов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/DataProcessors/торо_ПодборОбъектовРемонтныхРабот/Forms/ФормаПодбораСписковОРДляГрафикаРегламентныхМероприятий/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗапрашиватьВидРемонтныхРабот = Истина;
	
	Если Параметры.КлючНазначенияИспользования = "торо_ГрафикРегламентныхМероприятийТОиР" Тогда 
		ВидПодбора = "ВидРемонтныхРабот";
		Элементы.ТолькоГрафикиМероприятий.Видимость = Истина;
		ТолькоГрафикиМероприятий = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокОбъектов

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Выбрать(Неопределено);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выбрать(Команда)
	
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	ЗначениеВозврата = ОтобратьОбъекты(ВыделенныеСтроки);
	
	Если ТипЗнч(ЗначениеВозврата) = Тип("ДанныеФормыДерево") Тогда
		
		СтруктураВозврата = Новый Структура;
		СтруктураВозврата.Вставить("ТолькоГрафикиМероприятий", ТолькоГрафикиМероприятий);
		СтруктураВозврата.Вставить("Дерево", ЗначениеВозврата);
		ОповеститьОВыборе(СтруктураВозврата); 		
		
	ИначеЕсли ТипЗнч(ЗначениеВозврата) = Тип("СписокЗначений") Тогда
		
		ТекстЗаголовкаОкна = НСтр("es='Escojan los tipos de los trabajos de reparación';ru='Выберите виды ремонтных работ';en='Choose types of repair work'");
		ЗначениеВозврата.ПоказатьОтметкуЭлементов(Новый ОписаниеОповещения("ПослеВыбораВидовРемонта",ЭтотОбъект),ТекстЗаголовкаОкна);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПослеВыбораВидовРемонта(Список, ДополнительныеПараметры) Экспорт
	
	ВыбраныЭлементы = (Список <> Неопределено);
	
	Если ВыбраныЭлементы Тогда
		
		СтруктураВозврата = Новый Структура;
		СтруктураВозврата.Вставить("ТолькоГрафикиМероприятий", ТолькоГрафикиМероприятий);
		СтруктураВозврата.Вставить("Дерево", УдалитьНенужныеСтрокиДереваНаСервере(Список));

		ОповеститьОВыборе(СтруктураВозврата);
		
	КонецЕсли;
	
	ДеревоВыбрСтрок.ПолучитьЭлементы().Очистить();
	
КонецПроцедуры

&НаСервере
Функция УдалитьНенужныеСтрокиДереваНаСервере(СписокВыбранныхЗначений)
	
	ДеревоВыбранныхСтрок = РеквизитФормыВЗначение("ДеревоВыбрСтрок");
	
	Если ТипЗнч(СписокВыбранныхЗначений) = Тип("СписокЗначений") Тогда
		
		Если ВидПодбора="ВидРемонтныхРабот" Тогда 
			Если ЗапрашиватьВидРемонтныхРабот Тогда
				
				Для Каждого ЭлементСписка Из СписокВыбранныхЗначений Цикл
					
					МассивСтрокДерева = ДеревоВыбранныхСтрок.Строки.НайтиСтроки(Новый Структура("Объект", ЭлементСписка.Значение), Истина);
					
					Если Не ЭлементСписка.Пометка Тогда
						
						Для Каждого ЭлементМассива Из МассивСтрокДерева Цикл
							
							ЭлементМассива.Родитель.Строки.Удалить(ЭлементМассива);
							
						КонецЦикла; 
						
					КонецЕсли; 
					
				КонецЦикла;
				
				ЗначениеВРеквизитФормы(ДеревоВыбранныхСтрок, "ДеревоВыбрСтрок");
				Возврат ДеревоВыбрСтрок;
				
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ОтобратьОбъекты(ВыбранныеСтроки)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_СписокОбъектовРегламентногоМероприятия.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.торо_СписокОбъектовРегламентногоМероприятия КАК торо_СписокОбъектовРегламентногоМероприятия
	|ГДЕ
	|	торо_СписокОбъектовРегламентногоМероприятия.ЭтоГруппа = ЛОЖЬ
	|	И торо_СписокОбъектовРегламентногоМероприятия.Ссылка В ИЕРАРХИИ(&МассивСсылок)";
	
	Если НЕ УчитыватьИерархиюЭлементов Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "В ИЕРАРХИИ", "В");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("МассивСсылок", ВыбранныеСтроки);
	Выборка = Запрос.Выполнить().Выбрать();
	
	МассивОбъектов = Новый Массив;
	Пока Выборка.Следующий() Цикл 
		МассивОбъектов.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	ДеревоВыбранныхСтрок = РеквизитФормыВЗначение("ДеревоВыбрСтрок");
	СписокВидовРемонтов = Новый СписокЗначений;
	
	Для каждого ОбъектРР из МассивОбъектов Цикл
		ЗаполнитьСтрокуДереваВыбранныхОбъектов(ДеревоВыбранныхСтрок, ОбъектРР, СписокВидовРемонтов);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	торо_СписокОбъектовРегламентногоМероприятия.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ТЗ
	|ИЗ
	|	Справочник.торо_СписокОбъектовРегламентногоМероприятия КАК торо_СписокОбъектовРегламентногоМероприятия
	|ГДЕ
	|	торо_СписокОбъектовРегламентногоМероприятия.Ссылка В(&МассивОбъектов)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЗ.Ссылка КАК Ссылка
	|ИЗ
	|	ТЗ КАК ТЗ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_МаршрутыРегламентныхМероприятий КАК торо_МаршрутыРегламентныхМероприятий
	|		ПО ТЗ.Ссылка = торо_МаршрутыРегламентныхМероприятий.СписокОбъектов
	|ГДЕ
	|	торо_МаршрутыРегламентныхМероприятий.ОбъектРемонта ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЗ.Ссылка КАК Ссылка
	|ИЗ
	|	ТЗ КАК ТЗ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_РегламентныеМероприятияИСпискиОбъектов КАК торо_РегламентныеМероприятияИСпискиОбъектов
	|		ПО ТЗ.Ссылка = торо_РегламентныеМероприятияИСпискиОбъектов.СписокОбъектов
	|ГДЕ
	|	торо_РегламентныеМероприятияИСпискиОбъектов.СписокОбъектов ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	Результат = Запрос.ВыполнитьПакет();
	Если Не Результат[1].Пустой() Тогда
		Данные = Результат[1].Выгрузить();
		Для каждого Строка Из Данные Цикл
			ШаблонСообщения = НСтр("es='En la lista de los objetos регл. ¡Las medidas ""%1"" no entra ni un objeto de la reparación!';ru='В список объектов регл. мероприятия ""%1"" не входит ни одного объекта ремонта!';en='To the list of objects event ""%1"" does not include any repair objects!'");
			ТекстСообщения = СтрШаблон(ШаблонСообщения, Строка.Ссылка);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			Возврат 0;
		КонецЦикла; 
	КонецЕсли;
	
	Если Не Результат[2].Пустой() Тогда
		Данные = Результат[2].Выгрузить();
		Для каждого Строка Из Данные Цикл
			ШаблонСообщения = НСтр("es='Para la lista de los objetos регл. ¡Las medidas ""%1"" no son dadas las normas de la planificación!';ru='Для списка объектов регл. мероприятия ""%1"" не заданы нормативы планирования!';en=""For a list of objects activities '%1' did not set planning standards!""");
			ТекстСообщения = СтрШаблон(ШаблонСообщения, Строка.Ссылка);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			Возврат 0;
		КонецЦикла; 
	КонецЕсли;	
	
	ЗначениеВРеквизитФормы(ДеревоВыбранныхСтрок, "ДеревоВыбрСтрок");
	
	Если СписокВидовРемонтов.Количество() = 0  Тогда
		Возврат ДеревоВыбрСтрок;		
	КонецЕсли;
	
	Если ВидПодбора="ВидРемонтныхРабот" Тогда 
		Если ЗапрашиватьВидРемонтныхРабот Тогда  			
			Возврат СписокВидовРемонтов;  
		Иначе
			Возврат ДеревоВыбрСтрок;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ДеревоВыбрСтрок;
	
КонецФункции // ОтобратьОбъекты()

// Функция возвращает таблицу объектов ремонта из переданной в качестве параметра таблицы иерархии, 
// родителями которых является указаный ОР.
//
&НаСервере
Процедура ЗаполнитьСтрокуДереваВыбранныхОбъектов(ДеревоВыбранныхЗначений, МассивОбъектов,  СписокВидовРемонтов)
	
	СтрокаМаршрут = ДеревоВыбранныхЗначений.Строки.Добавить();
	СтрокаМаршрут.Объект = МассивОбъектов;
	
	СтруктураОтбора = Новый Структура("СписокОбъектов", МассивОбъектов);
	Выборка = РегистрыСведений.торо_РегламентныеМероприятияИСпискиОбъектов.Выбрать(СтруктураОтбора);
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.НеУчаствуетВПланировании Тогда
			ШаблонСообщения = НСтр("es='¡Para la lista de los objetos de las medidas de reglamento ""%1"" tipo de la medida ""%2"" no participa en la planificación!';ru='Для списка объектов регламентных мероприятий ""%1"" вид мероприятия ""%2"" не участвует в планировании!';en='For the list of scheduled events objects ""%1"" the type of event ""%2"" is not involved in the planning!'");
			ТекстСообщения = СтрШаблон(ШаблонСообщения, Строка(Выборка.СписокОбъектов), Строка(Выборка.ВидМероприятия));
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			Продолжить;
		КонецЕсли; 
		
		Если ТолькоГрафикиМероприятий и Не Выборка.ВидМероприятия.ГрафикМероприятий Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаМаршрут.Строки.Добавить().Объект = Выборка.ВидМероприятия;
		
		Если СписокВидовРемонтов.НайтиПоЗначению(Выборка.ВидМероприятия) = Неопределено Тогда
			
			СписокВидовРемонтов.Добавить(Выборка.ВидМероприятия, , Истина);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимость()
	
	Если ВидПодбора="ВидРемонтныхРабот" Тогда 
		Элементы.ПанельНастроекПодбора.ТекущаяСтраница = Элементы.ПанельНастроекПодбора.ПодчиненныеЭлементы.НастройкаПодбораВидаРемонтов;
	Иначе 
		Элементы.ПанельНастроекПодбора.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
